yunshu-drwells/SmartOffice/SmartOffice/Src/esp8266_web_DMA.c
static uint8_t ESP8266_AT_Test(void){
    const char* str = "AT\r\n";
    //HAL_UART_Transmit(&huart3, (uint8_t*)str, 4, HAL_MAX_DELAY);
	ESP8266_SendCmd(str);
	
	if (!ESP8266_WaitResponse_DMA("AT\r\n\r\nOK\r\n", 200))
    {
        printf("AT ERROR!\r\n");
        return 0;
    }
	printf("AT OK!\r\n");
	return 1;
}

/**
 * @brief 设置ESP8266为STA模式
 * @return 1 if successful, 0 if failed
 */
static uint8_t ESP8266_SetSTAMode(void)
{
    ESP8266_SendCmd("AT+CWMODE=1\r\n");
    if (!ESP8266_WaitResponse_DMA("AT+CWMODE=1\r\n\r\nOK\r\n", 1000))
    {
        //printf("Failed to set STA mode\r\n");
        return 0;
    }
	printf("Successed to set STA mode\r\n");
	return 1;
}

/**
 * @brief 断开可能存在的WiFi连接
 * @return 1 if successful, 0 if failed
 */
static uint8_t ESP8266_CWQAP(){
    ESP8266_SendCmd("AT+CWQAP\r\n");
    if (!ESP8266_WaitResponse_DMA("AT+CWQAP\r\n\r\nOK\r\n", 1000))
    {
        //printf("Failed to disconnect from AP\r\n");
        return 0;
    }
	printf("Successed to disconnect from AP\r\n");

    return 1;
}

/**
 * @brief 禁用自动连接
 * @return 1 if successful, 0 if failed
 */
/*
发送：
AT+CWAUTOCONN=0\r\n
接收：
AT+CWAUTOCONN=0\r\n\r\nOK\r\n
*/
uint8_t ESP8266_CWAUTOCONN(){
    ESP8266_SendCmd("AT+CWAUTOCONN=0\r\n");
    if (!ESP8266_WaitResponse_DMA("AT+CWAUTOCONN=0\r\n\r\nOK\r\n", 1000))
    {
        printf("Failed to disable auto-connect\r\n");
        return 0;
    }
	printf("Successed to disable auto-connect\r\n");

    return 1;
}

/**
 * @brief 使ESP8266连接到指定的WiFi热点
 * @param ssid WiFi的SSID
 * @param password WiFi的密码
 * @return 1 if successful, 0 if failed
 */
/*
AT+CWAUTOCONN=0

OK
*/
uint8_t _ESP8266_JoinAP(const char* ssid, const char* password)
{
    //char cmd[128];
	char* cmd = (char *)mymalloc(2, 128);;
    
    // 1. 设置WiFi模式为Station模式
	//已经完成了
	
    // 2. 连接到指定的AP
    sprintf(cmd, "AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password);
    ESP8266_SendCmd(cmd);
    
	/*
	if (!ESP8266_WaitResponse_DMA("WIFI CONNECTED\r\n", 20000)) {
        printf("Failed to connect to AP\r\n");
		myfree(2, cmd);
        return 0;
    }

    if (!ESP8266_WaitResponse_DMA("WIFI GOT IP\r\n", 10000)) {
        printf("Connection confirmation WIFI GOT IP failed\r\n");
		myfree(2, cmd);
        return 0;
    }

    if (!ESP8266_WaitResponse_DMA("\r\nOK\r\n", 5000)) {
        printf("Connection confirmation OK failed\r\n");
		myfree(2, cmd);
        return 0;
    }
	*/
	if (!ESP8266_WaitResponse_DMA("WIFI CONNECTED\r\nWIFI GOT IP\r\n\r\nOK\r\n", 5000)) {
        printf("Connection confirmation OK failed\r\n");
		myfree(2, cmd);
        return 0;
    }
	myfree(2, cmd);
	return 1;
}


/**
 * @brief 使ESP8266连接到指定的WiFi热点
 * @param ssid WiFi的SSID
 * @param password WiFi的密码
 * @return 1 if successful, 0 if failed
 */
/*
AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password
*/
uint8_t ESP8266_JoinAP(const char* ssid, const char* password)
{
    if(!_ESP8266_JoinAP(ssid, password)){
		printf("Failed to connect AP\r\n");
		return 0;
	}
	printf("Successfully connected to AP\r\n");
	return 1;
}

/**
 * @brief 获取ESP8266连接wifi所分配ip
 * @return 1 if successful, 0 if failed
 */
uint8_t ESP8266_GetIp()
{
	// 3. 查询IP地址以确认连接
    ESP8266_SendCmd("AT+CIFSR\r\n");
    if (!ESP8266_WaitResponse_DMA("AT+CIFSR", 5000)) {
        printf("Failed to get IP address\r\n");
        return 0;
    }
    
    printf("Successfully get IP address\r\n");
    return 1;
}

/**
 * @brief 开启或关闭多连接
 * @param enable 1开启,0关闭
 * @return 1 if successful, 0 if failed
 */
static uint8_t ESP8266_Enable_MultipleId(int enable) {
    char command[20] = {0};
	snprintf(command, sizeof(command), "AT+CIPMUX=%d\r\n", enable);
    //printf("command %s\n", command);
    
    ESP8266_SendCmd(command);
	snprintf(command, sizeof(command), "AT+CIPMUX=%d\r\n\r\nOK\r\n", enable);
    // 等待响应
    if (!ESP8266_WaitResponse_DMA(command, 5000)) {
        printf("Failed to set Multiple %d\r\n", enable);
        return 0;
    }
	printf("Successfully set Multiple %d \r\n", enable);
    return 1;
}


/**
 * @brief 使ESP8266开启服务器模式
 * @return 1 if successful, 0 if failed
 */
static uint8_t _ESP8266_Enable_SERVER() {
    ESP8266_SendCmd("AT+CIPSERVER=1,80\r\n");
    // 等待响应 首次设置和第二次设置成功返回字符是不同的
    if (!ESP8266_WaitResponse_DMA("AT+CIPSERVER=1,80\r\n\r\nOK\r\n", 5000)){
		ESP8266_SendCmd("AT+CIPSERVER=1,80\r\n");
		if (!ESP8266_WaitResponse_DMA("AT+CIPSERVER=1,80\r\nno change\r\n\r\nOK\r\n", 5000)) {
			printf("Failed to set SERVER\r\n");
			return 0;
		}
    }
	printf("Successfully set SERVER\r\n");
    return 1;
}

/**
 * @brief 使ESP8266开启服务端模式
 * @return 1 if successful, 0 if failed
 */
/*
AT+CIPMUX=1
AT+CIPSERVER=1,80
*/
void ESP8266_Enable_SERVER(){
	//等待禁用ESP8266多连接成功
	while( ! ESP8266_Enable_MultipleId(1) );
	
	//等待设置为客户端模式成功
	while( ! _ESP8266_Enable_SERVER() );
}


/**
 * @brief 使ESP8266开启客户端模式
 * @return 1 if successful, 0 if failed
 */

static uint8_t _ESP8266_Enable_Client(){
	ESP8266_SendCmd("AT+CIPSERVER=0\r\n");
    // 等待响应
    if (!ESP8266_WaitResponse_DMA("AT+CIPSERVER=0\r\n\r\nOK\r\n", 5000)){
		printf("Failed to set Client\r\n");
		return 0;
    }
	printf("Successfully set Client\r\n");
    return 1;
}

/*
AT+CIPSERVER=0
AT+CIPMUX=0
*/
void ESP8266_Enable_Client(){
	//等待设置为客户端模式成功
	while( ! _ESP8266_Enable_Client() );
	
	//等待禁用ESP8266多连接成功
	while( ! ESP8266_Enable_MultipleId(0) );
}

/**
 * @brief 设置ESP8266服务器超时时间
 * @return 1 if successful, 0 if failed
 */
static uint8_t ESP8266_Enable_STO() {
    ESP8266_SendCmd("AT+CIPSTO=60\r\n");
    // 等待响应
    if (!ESP8266_WaitResponse_DMA("AT+CIPSTO=60\r\n\r\nOK\r\n", 5000)) {
        printf("Failed to set STO\r\n");
        return 0;
    }
	printf("Successfully set STO\r\n");
    return 1;
}

#include "web.h"  //webstinfo
/**
* @brief  ESP8266 连接wifi函数
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
void ESP8266_Connect_Wifi(const char* ssid, const char* password)
{
	//等待AT命令成功
	while( ! ESP8266_AT_Test() );

