yunshu-drwells/SmartOffice/SmartOffice/Src/esp8266_web_DMA.c
	//printf("webstinfo:%p\n", webstinfo);
	//printf("webstinfo->index_html_size:%u\n", webstinfo->index_html_size);
	//等待设置WiFi模式为STA成功
	while( ! ESP8266_SetSTAMode() );
	//等待断开可能存在的WiFi连接成功
	while( ! ESP8266_CWQAP() );
	//等待禁用自动连接成功
	while( ! ESP8266_CWAUTOCONN() );

	//等待成功连接到某个指定的wifi并获取ip地址
	while( ! ESP8266_JoinAP(ssid, password) );
	
	//获取ip地址
	while( ! ESP8266_GetIp() );
	
	//等待开启ESP8266多连接成功
	while( ! ESP8266_Enable_MultipleId(1) );
	
	//等待设置为服务器模式成功
	while( ! _ESP8266_Enable_SERVER() );
	
	//等待设置服务器超时时间成功
	while( ! ESP8266_Enable_STO() );
}

/**
* @brief  ESP8266 处理网络请求数据
* @param  无
* @retval 无
*/
void ESP8266_CheckRecvData(void)
{
	if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
		__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

		printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
		printf("Uart3 Received data length:%d\n", uart3_rx_index);
		//解析Fan ip地址
		/*
		char *pdest = strstr((char*)uart3_rx_buffer, "Fan:");
		if(pdest){
			strcpy(FAN_ip_address, pdest+4);
			printf("FAN_ip_address:%s\n", FAN_ip_address);
		}
		*/
		/*
		//解析web请求
		//POST /CMD/MasterLight_On HTTP/1.1
		//解析POST命令请求
		char cmd[16] = {0};
		char* POST = strstr((char*)uart3_rx_buffer, "POST /CMD/");
		char* end = strstr((char*)uart3_rx_buffer, "HTTP/");
		char* cmd_start = POST+10;
		char* cmd_end = strstr(cmd_start, " ");
		strncpy(cmd, POST+10, cmd_end-cmd_start);
		printf("cmd:%s", cmd);
		*/

		//ClearUart3ReceiveBuff();
	 }
}

/*
FAN_ON
FAN_OFF

MasterLight_ON&R=<>&G=<>&B=<> (MasterLight_ON&R=255&G=255&B=255)
MasterLight_OFF

SpotLight_ON&R=<>&G=<>&B=<> (SpotLight_ON&R=255&G=255&B=255)
SpotLight_OFF
*/

/*
AT+CWMODE=1  //设置ESP8266为STA模式 
AT+CWQAP  //断开可能存在的WiFi连接
AT+CWAUTOCONN=0  //禁用自动连接
AT+CWJAP="Yunshu_Drwells","yzy@0203yzy@0203"  //连接到指定的AP
AT+CIFSR  //查询IP地址以确认连接
AT+CIPMUX=1  //使用多连接(可以同时处理多个TCP/UDP连接)
AT+CIPSERVER=1,80  //设置为服务器模式，并在指定端口（例如80）上监听
AT+CIPSTO=60  //设置服务器超时时间（单位：秒，0表示永不超时）影响的是TCP连接的保持时间
*/







/*
AT+CIPSTART=0,"UDP","255.255.255.255",8080
AT+CIPSEND=0,16
> DISCOVER_DEVICES

AT+CIPSTART=0,"UDP","255.255.255.255",8080  //0: 这是连接ID，用于标识多连接模式下的不同连接。所有接收到广播数据包的设备必须在该端口上监听，才能接收到数据。
AT+CIPSEND=0,16  // 发送16字节的数据
> DISCOVER_DEVICES  // 输入要发送的数据
*/

/*
// 发起UDP广播
sendATCommand("AT+CIPSTART=0,\"UDP\",\"255.255.255.255\",8080");
sendATCommand("AT+CIPSEND=0,16");
sendATCommand("Hello, IoT Devices!");
*/


// 发送广播消息
char sendBroadcastCmd[] = "AT+CIPSTART=0,\"UDP\",\"255.255.255.255\",8080\r\n";

/*
发送：
AT+CIPSTART=0,"UDP","255.255.255.255",8080
成功接收：
AT+CIPSTART=0,"UDP","255.255.255.255",8080
0,CONNECT

OK
*/
uint8_t _ESP8266_sendBroadcastCmd(){
	ESP8266_SendCmd(sendBroadcastCmd);
    // 等待响应
    if (!ESP8266_WaitResponseFor("OK", 5000)) {
        printf("Failed to send Broadcast Cmd\r\n");
        return 0;
    }
	printf("Successfully sent Broadcast Cmd\r\n");
    return 1;
}

/*
发送：
AT+CIPSEND=0,16
成功接收：
RX：AT+CIPSEND=0,16

OK
> 
*/
uint8_t _ESP8266_sendDataCmd(char* sendDataCmd){
	ESP8266_SendCmd(sendDataCmd);
    // 等待响应
    if (!ESP8266_WaitResponseFor(">", 5000)) {
        printf("Failed to send Data Cmd: %s\r\n", sendDataCmd);
        return 0;
    }
	printf("Successfully sent Data Cmd: %s\r\n", sendDataCmd);
    return 1;
}

/*
发送：
DISCOVER_DEVICES
成功接收：
ES

busy s...

Recv 16 bytes

SEND OK
*/
uint8_t _ESP8266_broadcastMessage(char* broadcastMessage){
	ESP8266_SendCmd(broadcastMessage);
    // 等待响应
    if (!ESP8266_WaitResponseFor("SEND OK", 5000)) {
        printf("Failed to send broadcast Message: %s\r\n", broadcastMessage);
        return 0;
    }
	printf("Successfully sent broadcast Message: %s\r\n", broadcastMessage);
    return 1;
}

/**
* @brief  ESP8266 发送广播消息
* @param  无
* @retval 无
*/
//通过广播发起请求，然后让所有物联网设备返回自己的设备名称和ip地址，最后再通过ip地址的建立tcp从而与子模块通信
//这样会损耗cpu性能，直接使用广播的方式对所有物联网设备进行控制
void ESP8266_sendBroadcastCmd(char* broadcastMessage)
{
	char sendDataCmd[18] = {0};
	sprintf(sendDataCmd, "AT+CIPSEND=0,%d\r\n", strlen(broadcastMessage));
	
	//等待 AT+CIPSEND=0,16 命令成功
	while( ! _ESP8266_sendDataCmd(sendDataCmd) );
	
	//等待 发送信息成功
	while( ! _ESP8266_broadcastMessage(broadcastMessage) );
}

//#include "esp8266_fan.h"  //GetFanModuleIP

/*
FAN_ON
FAN_OFF

MasterLight_ON&R=<>&G=<>&B=<> (MasterLight_ON&R=255&G=255&B=255)
MasterLight_OFF

SpotLight_ON&R=<>&G=<>&B=<> (SpotLight_ON&R=255&G=255&B=255)
SpotLight_OFF

CONNECT_NEW_WIFI&ssid=Yunshu_Drwells&pwd=yzy@0203yzy@0203
*/

void ESP8266_startBroadCastCmd(){
	//等待 AT+CIPSTART=0,"UDP","255.255.255.255",8080 命令成功
	while( ! _ESP8266_sendBroadcastCmd() );
}


/**
* @brief  ESP8266 连接新wifi函数
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
/*
AT+CWQAP\r\n
AT+CWAUTOCONN=0\r\n
AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password
*/
uint8_t ESP8266_Connect_New_Wifi(const char* ssid, const char* password)
{
	//等待断开可能存在的WiFi连接成功
	//while( ! ESP8266_CWQAP() );
	//等待禁用自动连接成功
	//while( ! ESP8266_CWAUTOCONN() );
	//等待成功连接到某个指定的wifi并获取ip地址
	if( ! ESP8266_JoinAP(ssid, password) ){
		//失败
		return 0;
	}else{  
		//能成功连接
		return 1;
	}
}


/**
* @brief  ESP8266 连接新wifi函数
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
void ESP8266_Connect_New_Wifi_ALL(const char* ssid, const char* password)
{
	/*
	//在连接新wifi之前统计所有物联网设备数
	uint8_t devices = ESP8266_Count_Devices();

	//等待成功连接到某个指定的wifi并获取ip地址
	if( ! ESP8266_Connect_New_Wifi(ssid, password) ){
		//失败
		//连接回默认wifi
		while(!ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd));
	}else{  //能成功连接
	    //检查空闲的ip地址数是否大于所有的物联网设备数
		uint8_t ips = ESP8266_Count_Free_ips();
		if(devices >= ips){
			//无法满足要求
			//连接回默认wifi
			while(!ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd));
		}else{
			//可以满足要求
			//连接回旧wifi
			while(!ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd));
			//通知所有物联网设备连接新wifi
			//...
		}
	}
	*/
	//等待成功连接到某个指定的wifi并获取ip地址
	if( ! ESP8266_Connect_New_Wifi(ssid, password) ){
		//失败
		//连接回默认wifi
		while(!ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd));
	}else{  //能成功连接
		printf("start connect to old wifi\n");
		//连接回默认wifi
		ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd);
		printf("connected to old wifi\n");
		//开启广播
		//ESP8266_startBroadCastCmd();
		
		//通知所有物联网设备连接新wifi
		//发送广播消息，让所有的物联网设备连接新wifi
		char sendDataCmd[128] = {0};
		sprintf(sendDataCmd, "CONNECT_NEW_WIFI&ssid=%s&pwd=%s", ssid, password);
		ESP8266_sendBroadcastCmd(sendDataCmd);
		printf("message all\n");
		
		//再连接回新wifi
		ESP8266_Connect_New_Wifi(ssid, password);
		printf("connected new wifi\n");
		//开启广播
		//ESP8266_startBroadCastCmd();
	}
}

void ESP8266_Lora_SenCmd(const char* str){
	HAL_UART_Transmit(&huart6, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
	//ESP8266_sendBroadcastCmd(str);
}

void Lora_OpenDoor(){
	ESP8266_Lora_SenCmd("Open_Door");
}




void test(){
	//测试风扇、主灯、射灯
	//ESP8266_startBroadCastCmd();
	
