yunshu-drwells/SmartOffice/SmartOffice/Src/esp8266_web_DMA.c
	//char broadcastMessage[] = "MasterLight_ON&R=255&G=255&B=255";
	//发送广播
	//ESP8266_sendBroadcastCmd(broadcastMessage);
	//ESP8266_sendBroadcastCmd("MasterLight_ON&R=255&G=255&B=255");
	/*	
	ESP8266_sendBroadcastCmd("FAN_ON");
	ESP8266_sendBroadcastCmd("MasterLight_ON&R=255&G=255&B=255");
	ESP8266_sendBroadcastCmd("SpotLight_ON&R=255&G=255&B=255");

	ESP8266_sendBroadcastCmd("FAN_OFF");
	ESP8266_sendBroadcastCmd("MasterLight_OFF");
	ESP8266_sendBroadcastCmd("SpotLight_OFF");
	*/
	
	//测试电磁门锁
	//Lora_OpenDoor();
	
	//测试wifi
	//ESP8266_Connect_New_Wifi_ALL(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd);
	ESP8266_Connect_New_Wifi_ALL("Yunshu_Drwells", "yzy@0203yzy@0203");
	
	
}


/**
* @brief  统计连接了当前wifi的物联网设备数
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
/*
uint8_t ESP8266_Count_Devices(){
	return 0;
}
*/


/*
static uint8_t parseResponse(char *response)
{
  uint8_t freeIPCount = 0;
  // 解析响应，提取空闲IP地址数量
  // 这里只是一个简单的示例，实际解析逻辑可能更复杂
  char *token = strtok(response, ",");
  while (token != NULL)
  {
    if (strstr(token, "+CWLAP:") != NULL)
    {
      // 提取空闲IP地址数量
      freeIPCount = atoi(strtok(NULL, ":"));
      char countStr[10];
      sprintf(countStr, "%d", freeIPCount);
    }
    token = strtok(NULL, ",");
  }
  return freeIPCount;
}
*/

/*
static uint8_t ESP8266_WaitResponse_ForCWLAP(const char* expected_response, uint32_t timeout){
	//uint32_t startTime = HAL_GetTick();
	//while ((HAL_GetTick() - startTime) < timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

			//用于调试某个AT命令的返回值
			if(!strcmp(expected_response, "OK")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
			}


			//将ESP8266的数据转发给Uart1
				if(!strcmp(expected_response, "OK")){		
					printf("identical \n");
				}

				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}
*/


/**
* @brief  获取所有可用的wifi
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
/*
uint8_t ESP8266_Get_Enable_Wifi(){
    ESP8266_SendCmd("AT+CWLAP\r\n");
	uint8_t res = ESP8266_WaitResponse_ForCWLAP("OK", 5000);
    if (!res) {
        printf("Failed to get free ip or no free ip\r\n");
        return 0;
    }
	printf("Successfully get free ip\r\n");
	return res;
}
*/

/*
static int findNthOccurrence(const char *str, char ch, int n) {
    const char *ptr = str;
    int count = 0;

    while (*ptr != '\0') {
        if (*ptr == ch) {
            count++;
            if (count == n) {
                return ptr - str; // 返回相对于字符串起始位置的偏移量
            }
        }
        ptr++;
    }

    return -1; // 没有找到第n个字符
}
*/

/*
static uint8_t ESP8266_WaitResponse_ForPING(const char* expected_response, uint32_t timeout){
	//uint32_t startTime = HAL_GetTick();
	//while ((HAL_GetTick() - startTime) < timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

			//用于调试某个AT命令的返回值
			if(!strcmp(expected_response, "OK")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
			}

			//将ESP8266的数据转发给Uart1
			if(!strcmp(expected_response, (const char*)uart3_rx_buffer) || strstr((const char*)uart3_rx_buffer, expected_response)) {
				if(!strcmp(expected_response, "OK")){		
					printf("identical \n");
				}

				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}
*/

/*
static uint8_t ESP8266_WaitResponse_ForARP(const char* expected_response, uint32_t timeout){
	//uint32_t startTime = HAL_GetTick();
	//while ((HAL_GetTick() - startTime) < timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

			//用于调试某个AT命令的返回值
			if(!strcmp(expected_response, "OK")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
			}

			//将ESP8266的数据转发给Uart1
			if(!strcmp(expected_response, (const char*)uart3_rx_buffer) || strstr((const char*)uart3_rx_buffer, expected_response)) {
				if(!strcmp(expected_response, "OK")){			
					printf("identical \n");
				}
				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}
*/

/**
 * @brief  发送 ARP 请求
 * @param  ip_address: 目标 IP 地址
 * @return 成功返回 1，失败返回 0
 */
/*
int sendARPRequest(const char *ip_address) {
    char cmd[50];
    sprintf(cmd, "AT+CIPARP=\"%s\"\r\n", ip_address);
    ESP8266_SendCmd(cmd);
    return ESP8266_WaitResponse_ForARP("OK", 1000);
}
*/


/**
* @brief  统计连接的当前wifi的空闲ip数量
 * @param 无
 * @return 空闲ip数
*/
/*
uint8_t ESP8266_Count_Free_ips(){
	 // 发送AT指令执行ping命令
    //sendATCommand("AT+PING=\"www.google.com\"\r\n");
	
	//获取已经使用的ip数量
	uint8_t usedIPs = 0;
	uint8_t freeIps = 0;
	char temp_ip_address[MAX_IP_LENGTH] = {0};
	strcpy(temp_ip_address, ip_address);
	char str[4];
	//192.168.2.38
	//找到第三个.的下标
	int index = findNthOccurrence(temp_ip_address, '.', 3);
	//AT命令
	//char cmd[26] = {0};
	for(uint8_t i=0; i<255; i++){  //[0:254]
		// 使用sprintf将uint8_t转换为字符串
		sprintf(str, "%u", i);
		strncpy(temp_ip_address+index+1, str, 4);

